app/controllers/queries_controller.rb

INSERT INTO "queries" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "dasd"], ["created_at", "2018-04-27 01:41:29.552939"], ["updated_at", "2018-04-27 01:41:29.552939"]]
---
	def create
		params[:name].downcase!
		@query = Query.find_or_create_by(query_params)

SELECT  "queries".* FROM "queries" WHERE "queries"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
	def show
		@query = Query.find(params[:id])